{
    "id": "1",
    "title": "Polls App",
    "description": "A Django application for posting fun questions and voting on them.",
    "image": "PollsHomePage.jpg",
    "image2": "PollsQuestionCategories.jpg",
    "image3": "PollsTopic.jpg",
    "image4": "PollsVote.jpg",
    "image5": "PollsResults.jpg",
    "image6": "PollsSubmit.jpg",
    "github": "https://github.com/Alvirah-Ro/polls",
    "liveDemo": "https://yourportfolio.com",
    "technologies": ["Django", "Python"],
    "longDescription1": "Polls App is a Django Application that uses SQLite Database.  It began with the Django tutorial, 'Writing your first Django app', and grew from there.  The tutoral included instructions for creating the basic Question and Choice models and registering them with the admin site.  I then created a superuser for site administration and started adding views.  These included views for displaying the five most recent questions, displaying question details with choices and voting functionality, and displaying voting results.  ",
    "longDescription2": "I then started adding my own functionality to the app.  I wanted to create more ways to sort questions so I added views for oldest questions, most popular questions, and all questions.  I also created a new Topic model related to the Question model via a many-to-many relationship and added views for dipslaying lists of topics and lists of questions by topic.  The next step was creating a way to add a question.  This view allows users to add question text, 2-5 possible answer choices, multiple topic choices, and the ability to create a new topic.  I then added buttons for navigating between different views and added css styling to each page.",
    "longDescription3": "I have ideas for improving the app in the future.  The tutorial included some tests, but I want to add more.  I also would add field sets and functionality to the admin site.  It could also be fun to create a way to add more answers choices to existing questions for voters who aren't satisfied with the given choices."
}
